
<!-- PHP-তে substr() ফাংশন ব্যবহার করে আপনি একটি স্ট্রিং থেকে নির্দিষ্ট অংশ কেটে নিতে পারেন। এটি প্রথম প্যারামিটার হিসেবে স্ট্রিং গ্রহণ করে, দ্বিতীয় প্যারামিটার হিসেবে কোথা থেকে শুরু হওয়া উচিত এবং ঐচ্ছিক তৃতীয় প্যারামিটার হিসেবে কতটুকু অংশ নেওয়া হবে তা নির্ধারণ করে। -->

<?php
$string = "আমি বাংলা বলি";

// প্রথম 5 অক্ষর কেটে নেওয়া
$part = substr($string, 0, 5);
echo $part;  // আমি বা
?>

<!-- 
আপনি যদি কোন স্ট্রিং এর শেষ থেকে কিছু অংশ নিতে চান, তাদি আপনি ঋণাত্মক সংখ্যা ব্যবহার করতে পারেন: -->


<?php
$string = "আমি বাংলা বলি";

// স্ট্রিং এর শেষ থেকে 4 অক্ষর কেটে নেওয়া
$part = substr($string, -4);
echo $part;  // বলি
?>
