<!-- array_diff একটি PHP ফাংশন, যা দুটি বা ততোধিক অ্যারের মধ্যে পার্থক্য বের করতে ব্যবহার করা হয়। এই ফাংশনটি প্রথম অ্যারে থেকে অপর অ্যারে গুলির মধ্যে যেগুলি আছে তাদের বাদ দেয়া হয়। -->

<!-- < ?php array array_diff ( array $array1 , array $array2 [, array $... ] ) ?> 

$array1: এটি হলো প্রথম অ্যারে, যা থাকবে সংশ্লিষ্ট অন্য অ্যারেগুলির সাথে তুলনা করা হবে।
$array2: এটি হলো দ্বিতীয় অ্যারে, যা প্রথম অ্যারের সাথে তুলনা করা হবে।
$...: এই এর পরে আরও অ্যারে যোগ করা হতে পারে, যাদের সাথে তুলনা হবে। -->

<?php
   
    $array1 = array("a" => "red", "b" => "green", "c" => "blue");
    $array2 = array("a" => "red", "b" => "green", "c" => "blue", "d" => "yellow");

    $result = array_diff($array2, $array1);

    print_r($result);

?>
<!-- এই উদাহরণে, array_diff ফাংশনটি দুটি অ্যারের ("a" => "red", "b" => "green", "c" => "blue", "d" => "yellow") মধ্যে পার্থক্য বের করবে এবং তা রিটার্ন করবে যে অ্যারে এই পার্থক্য থাকে (এখানে "d" => "yellow")। -->


<!-- 
Output :

    Array
        (
            [d] => yellow
        ) 

-->

<!-- array_diff ফাংশনটি একটি অ্যারে থেকে অন্য অ্যারের সাথে পার্থক্য বের করতে ব্যবহার হয়। -->
