
<!-- array_diff_assoc() হলো PHP একটি ফাংশন, যা দুটি বা ততোধিক অ্যারের মধ্যে ইনডেক্স এবং মান উভয়ই মিলিত থাকলেও মিলিত না থাকলেও পার্থক্য বের করতে ব্যবহার করা হয়। এই ফাংশনটি প্রথম অ্যারে থেকে অপর অ্যারে গুলির মধ্যে ইনডেক্স এবং মান উভয়ই মিলিত থাকলে তাদেরকে বাদ দেয়।

array array_diff_assoc ( array $array1 , array $array2 [, array $... ] )

$array1: এটি হলো প্রথম অ্যারে, যা থাকবে সংশ্লিষ্ট অন্য অ্যারেগুলির সাথে তুলনা করা হবে।
$array2: এটি হলো দ্বিতীয় অ্যারে, যা প্রথম অ্যারের সাথে তুলনা করা হবে।
$...: এই এর পরে আরও অ্যারে যোগ করা হতে পারে, যাদের সাথে তুলনা হবে।

-->

<?php

    $array1 = array("a" => "red", "b" => "green", "c" => "blue", "d" => "yellow");
    $array2 = array("a" => "red", "b" => "green", "p" => "blue", "d" => "yellow");
   

    $result = array_diff_assoc($array2,$array1);

    print_r($result);
?>



<!-- এই উদাহরণে, array_diff_assoc ফাংশনটি দুটি অ্যারের ("a" => "red", "b" => "green", "c" => "purple", "d" => "yellow") মধ্যে ইনডেক্স এবং মান উভয়ই মিলিত না থাকলে সেগুলি বের করবে এবং তা রিটার্ন করবে।

 

Output :

Array
(
    [c] => purple
)


array_diff_assoc ফাংশনটি একটি অ্যারে থেকে অন্য অ্যারের সাথে ইনডেক্স এবং মান উভয়ই মিলিত না থাকলে পার্থক্য বের করতে ব্যবহার হয়।

-->