<!-- PHP তে Math এর ফাংশন গুলি বিভিন্ন প্রকার গাণিতিক কার্যকলাপ ও গণনা সম্পর্কে সেবা প্রদান করে। এই ফাংশনগুলির মাধ্যমে সংখ্যা গোলাকর করা, এলোমেলো সংখ্যা উত্পন্ন করা, ত্রিকোণমিতি গণনা, ঘাত গণনা ইত্যাদি করা সম্ভব। -->

<?php
    echo(pi()); // returns 3.1415926535898
?>

<?php
    echo(min(0, 150, 30, 20, -8, -200));  // returns -200
    echo(max(0, 150, 30, 20, -8, -200));  // returns 150
?>

<?php
    echo(abs(-6.7));  // returns 6.7
?>

<?php
    echo(sqrt(64));  // returns 8
?>

<?php
    echo(round(0.60));  // returns 1
    echo(round(0.49));  // returns 0
?>

<?php
    echo(rand());
?>

<?php
    echo(rand(10, 100));
?>
