<!-- PHP তে die() এবং exit() ফাংশন দুটি সমান কাজ করে। উল্লেখযোগ্য যে, এই দুটি ফাংশন একে অপরের এলিয়াস। অর্থাৎ, দুটি ফাংশনের ফাংশনালিটি একই।

এই ফাংশনগুলির প্রধান কাজ হলো স্ক্রিপ্টের এক্সিকিউশন বন্ধ করা। সাধারণতঃ কোন ত্রুটির কারণে অথবা নির্দিষ্ট পরিস্থিতিতে স্ক্রিপ্টের এক্সিকিউশন স্থগিত করার জন্য এই ফাংশনগুলি ব্যবহার করা হয়। -->

    <?php

    // if (!file_exists('important_file.txt')) {
    //     die('Error: The file does not exist.');
    // }
    //     //উপরের কোড সম্পাদন বন্ধ হলে, এই লাইন কখনও রান হবে না।
    // echo "File exists!";

    ?>

<!-- উপরের উদাহরণে, আমরা দেখি যদি important_file.txt ফাইল না থাকে, তাহলে স্ক্রিপ্ট die() ফাংশনে আসবে এবং "Error: The file does not exist." মেসেজ প্রিন্ট করবে এবং স্ক্রিপ্টের এক্সিকিউশন স্থগিত করবে। অতএব, "File exists!" প্রিন্ট করা হবে না।

আপনি exit() ফাংশনও একই উদ্দেশ্যে ব্যবহার করতে পারেন এবং তা ঠিক একই ভাবে কাজ করবে।

নোট: die() এবং exit() ফাংশনে অপশনাল একটি প্যারামিটার প্রেরণ করা যায় যা স্ক্রিপ্ট বন্ধ করার সময় প্রিন্ট হবে। এটি একটি স্ট্রিং অথবা একটি সংখ্যা হতে পারে যা স্ক্রিপ্টের প্রতিস্থাপন কোড হিসাবে ব্যবহার করা হয়। -->


<?php

    // die_&_exit.php

    echo "1. Hello World . <br/>";
    echo "2. Hello World .<br/>";
    echo "3. Hello World .<br/>";
    // die();
    exit("The End");
    echo "4. Hello World . <br/>";
    echo "5. Hello World . <br/>";



?>